<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" 
  "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current release version of Visual Studio Code.</string>
  <key>Identifier</key>
  <string>com.github.valdore86.download.visualstudiocode</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Visual Studio Code</string>
    <key>USER_AGENT</key>
    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.0.4</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
        <string>vscode.zip</string>
        <key>url</key>
        <string>https://code.visualstudio.com/sha/download?build=stable&amp;os=darwin-universal</string>
        <key>request_headers</key>
        <dict>
          <key>user-agent</key>
          <string>%USER_AGENT%</string>
        </dict>
        <key>max_retries</key>
        <integer>5</integer>
        <key>retry_delay</key>
        <integer>10</integer>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key>
        <string>%pathname%</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
        <key>purge_destination</key>
        <true/>
      </dict>
      <key>Processor</key>
      <string>Unarchiver</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/Visual Studio Code.app</string>
        <key>requirement</key>
        <string>identifier "com.microsoft.VSCode" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9</string>
      </dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_plist_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%/Visual Studio Code.app/Contents/Info.plist</string>
        <key>plist_version_key</key>
        <string>CFBundleShortVersionString</string>
      </dict>
      <key>Processor</key>
      <string>Versioner</string>
    </dict>
  </array>
</dict>
</plist>
